[{"title":"Traveling through Maine 200 Years Ago","slug":"intro","entry_date":"16 September, 1820","lat":46.25,"lon":-68.8,"zoom_level":8,"is_flippable":false,"entry_text":"","interpret_blurb":"<p>Joseph Treat, Penobscot leader John Neptune, and Treat&rsquo;s cousin, Jacob Holyoke, traveled over 500 miles by canoe or on foot during their journey north. They passed through lands well-known to the Wabanaki as home. The lands were less well-known to the government of Maine, which also claimed them and their rich timber resources.</p><p>Treat&rsquo;s official function, as assigned by Maine&rsquo;s new governor, was to report on the forests and soils. Treat also recorded Wabanaki names of rivers and mountains, interviewed settlers he met, and described, in sometimes painful detail, the journey&apos;s difficulties brought by supply shortages and bad weather.</p>","interpret_more":""},{"title":"Old Town/Indian Island","slug":"old-town","entry_date":"26 September, 1820","lat":44.9361,"lon":-68.6721,"zoom_level":9,"is_flippable":true,"entry_text":"<p><br></p><p><em>Arrived at Old Town at 1 P.M. &ndash; left there at 3 P.M. the</em></p><p><em>Present residence of the Penobscot Indians, and since their residence has been on the Penobscot River or Rocky Island the whole River has taken the same name &ndash; this has</em></p><p><em>not been their chief place of Residence they say more than 1 or 200 years &ndash;</em></p><p><em>their Towns were formerly on Now,at,kee,mongon [Freese Island] and Passadunkee Islands[Thorofare].</em></p><p><em>Old Town Island is situated 40 rods above the great</em></p><p><em>falls of the same name, and is a very pleasant place.</em></p><p><em>Sunkhaze is a large Stream coming in from the east.</em></p><p><em>The land on both sides of the River from this Stream up to</em></p><p><em>Sugar Island is very good for one mile back - some ridges run further &ndash;</em></p><p><em>but generally the back land is not so good, low boggy and wet - on the</em></p><p><em>shores is fine intervale running back from 20 to 100 rods - the Islands are</em></p><p><em>all excellent land, alluvial soil, covered with a fine growth of</em></p><p><em>hard wood, such as Grey oak, Rock, Red and White maple, yellow</em></p><p><em>Birch, Beach and Elm. this tract must from appearances have formerly</em></p><p><em>been a Lake, and now is mostly flowed in high freshes.</em></p><p><em>Arrived at Castagan&rsquo;s at 9.P.M. and stop there.</em></p><p><em>Wednesday 27. Proceed up river &ndash; after buying another Birch Canoe,</em></p><p><em>which I am under the necessity of doing as I find by information from</em></p><p><em>Beeson who has lately returned from Canada, that the water up the</em></p><p><em>West Branch is extremely low &ndash; that it will be almost impossible to get</em></p><p><em>up with our baggage in one canoe. - Drew an order on Messrs Barker &amp;</em></p><p><em>Crosby for $5. in part pay for Canoe and Paddles &ndash; paid cash $1.00. &ndash;</em></p><p><br></p><p><br></p><p><br></p>","interpret_blurb":"<p>To begin their journey, Joseph Treat and Jacob Holyoke set off on foot along the Penobscot River while John Neptune paddled a single birch bark canoe loaded with baggage and supplies. &nbsp; Wabanaki coming downriver advised the three men that low water on the Penobscot would make it impossible for them to paddle upriver in one canoe. For six dollars, Treat then purchased another birch bark canoe and two paddles. The three men then set off again on what Treat called their &ldquo;tour of discoveries.&rdquo;</p>","interpret_more":"<p>Treat oriented this map with &ldquo;South&rdquo; at the top. He indicated the Penobscot village on Indian Island with a group of triangles that represented the dwellings there. Here, as throughout his journal, Treat most likely relied on information provided by John Neptune to record Wabanaki names for water and land features. In this way, Treat provided an early description of the Wabanaki homeland before it was transformed by treaties, non-Native land ownership, and industrial alterations to the rivers and lands.</p>"},{"title":"Passadumkeag River","slug":"passa-river","entry_date":"27 September, 1820","lat":45.1704,"lon":-68.6206,"zoom_level":10,"is_flippable":true,"entry_text":"<p>&nbsp; &nbsp;&nbsp;</p><p>&nbsp;<em>The land on the River banks continues good up to Passadunkee</em></p><p><em>Stream - This is a long and large stream - come in from the E. it has on</em></p><p><em>all its branches fifteen ponds, some of which are large - the land on the&nbsp;</em></p><p><em>banks of this stream thirty miles up is very low, but has much rich inter-</em></p><p><em>vale and meadow - the up land is said not to be very good. there is much</em></p><p><em>Pine timber on this stream and its branches - on the State&apos;s land as well</em></p><p><em>as that sold to Bingham. -</em></p><p><em>&nbsp; &nbsp; &nbsp;Arrived at Capt. Haynes at 5 P.M. and having disappointed of</em></p><p><em>getting a tent from Col. Lee, Mrs. Haynes commences making one of cot-</em></p><p><em>ton cloth brought for the purpose and have to wait for it until</em></p><p><em>Thursday at 28th noon. - then embark and proceed up river taking a</em></p><p><em>sketch of the River, &amp;c.</em></p>","interpret_blurb":"<p>While paddling up the Penobscot to the mouth of the Passadumkeag River, the expedition passed Olemon (Olammon), or Paint Stream, so called &ldquo;by reason of the Indians having formerly found good red paint or red ochre on this stream.&rdquo; The confluence of the Passadumkeag River and the Penobscot proved to be an attractive settlement spot for both Native and non-Native people. Treat hired one woman living there, Mrs. Haynes, to make a tent for them out of cotton cloth brought for the purpose. &nbsp;&nbsp;</p>","interpret_more":"<p>Treat oriented this map with &ldquo;South&rdquo; at the top. Birch bark wigwams (indicated by triangles) on the river&rsquo;s largest island (Thorofare Island) show Native settlements. More recent non-Native settlers are named and shown by houses lining the Penobscot&rsquo;s west bank. On the Penobscot River&rsquo;s east shore, Treat notes the &ldquo;Indian Eel ware camp&rdquo; and zigzag lines across the river. The eel weir, constructed and set by the Penobscots, caught American eels swimming downriver to spawn in saltwater.</p>"},{"title":"Pimolos Rock","slug":"pimol-rock","entry_date":"29 September, 1820","lat":45.5227,"lon":-68.3968,"zoom_level":10,"is_flippable":true,"entry_text":"<p>&nbsp; &nbsp; &nbsp;</p><p>&nbsp; &nbsp;<em>Maja &ndash; Obseoose, or Pimolos Rock &ndash; This is a large Rock&nbsp;</em></p><p><em>of granite in form of a small hay stack &ndash; and on the south side&nbsp;</em></p><p><em>near the top is a circular hole in form of a pot 2 feet deep &ndash; the&nbsp;</em></p><p><em>Indians say it has been their custom to place in this cavity when the&nbsp;</em></p><p><em>water is low, presents for Pimola, of Tobacco, Pipes, Jacknives &amp;c., and&nbsp;</em></p><p><em>if they are not taken out, they have a bad season for hunting&nbsp;</em></p><p><em>and fishing the next year &ndash; and if taken out they have great&nbsp;</em></p><p><em>good luck in every thing. - &frac12; mile above this Rock the Mad</em></p><p><em>awamkee comes in from the S.E. this is a large and long stream &ndash;&nbsp;</em></p><p><em>it has on all its branches 13 ponds, some very large. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp;Madawamkee Point, North of the Stream, the present&nbsp;</em></p><p><em>residence of John Attien, the Indian Governor, is a very pleasant&nbsp;</em></p><p><em>situation &ndash; there are three very good Wigwams here, and they have&nbsp;</em></p><p><em>raised this season 60 bushels of corn &ndash; 200 bushels of potatoes &ndash; beans&nbsp;</em></p><p><em>and peas &amp;c. &ndash; The corn is of a small yellow kind and ripened&nbsp;</em></p><p><em>early and is good&ndash; Arrived at the Governor&rsquo;s camp at 7 P.M.&nbsp;</em></p><p><em>and stay here this night. &ndash;</em></p><p><br></p><p><br></p>","interpret_blurb":"<p>On the fourth day of their journey, Treat, Neptune, and Holyoke passed another important Native community at the confluence of the Mattawamkeag and Penobscot Rivers. This &ldquo;pleasant situation,&rdquo; as Treat described it, was the residence of Penobscot Governor John Attean. In red on the 1820 map marking the expedition here, as well as in his journal, Treat shows &ldquo;Indian Townships.&rdquo; The two Indian Townships shown here, like two others upriver, were each six square miles and had been reserved for the Penobscots by an 1818 treaty with Massachusetts.&nbsp;</p>","interpret_more":"<p>Treat oriented this map with &ldquo;South&rdquo; at the top. Across the Penobscot River and a bit south from Governor Attien&rsquo;s residence was a large granite rock, Pimolos Rock, in the form of a small haystack. The rock, with a circular hole near the top that housed gifts for the spirit &ldquo;Pimola,&rdquo;was the center of an annual Penobscot ritual to ensure good hunting and fishing.&nbsp;</p>"},{"title":"Mt. Katahdin","slug":"mt-katahdin","entry_date":"08 October, 1820","lat":45.9282,"lon":-68.8293,"zoom_level":10,"is_flippable":false,"entry_text":"<p>&nbsp; &nbsp; &nbsp;</p><p>&nbsp; &nbsp; <em>Deeming it important to get all the information&nbsp;</em></p><p><em>respecting the Country about Ktadne I concluded to ascend the&nbsp;</em></p><p><em>mountain where I can obtain much accurate information as&nbsp;</em></p><p><em>to the number of Lakes and their names and bearing from Ktadne &ndash;&nbsp;</em></p><p><em>as also the quality of the land in that vicinity &ndash; the loss of time&nbsp;</em></p><p><em>can be very trifling compared with the advantages to be gained &ndash;&nbsp;</em></p><p><em>and accordingly accompanied by Mr. Holyoke, Neptune, F. Lolon,&nbsp;</em></p><p><em>and L. Neptune, we leave the River to ascend the mountain</em></p><p><em>at &frac12; past 3 P.M. &ndash; travelled North Easterly over very rough rocky&nbsp;</em></p><p><em>burnt land first rising a great Hill the summit of which is&nbsp;</em></p><p><em>2 or 3 miles from the River, then descending a little to a stream&nbsp;</em></p><p><em>from the Mtn. Called Obolgokmagessick, where we camp being about&nbsp;</em></p><p><em>4 miles from the River. &ndash;</em></p><p><em>Sunday morning 8th October &ndash; fine clear cold weather &ndash; After getting&nbsp;</em></p><p><em>breakfast at &frac12; past 6 A.M. strike our tent and pursue our journey</em></p><p><em>up the Mtn. &ndash; we arrive at the summit at 1 P.M. extremely cold.</em></p><p><em>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; This mountain is at least 6,000 feet high &ndash; it is N.&nbsp;</em></p><p><em>42. E. from the mouth of the Obolgockmagessick stream or 2 streams&nbsp;</em></p><p><em>the mouths of which are 40 rods apart one coming from the S. side,&nbsp;</em></p><p><em>the other from the West from near the top of the Mtn. 10 miles distance&nbsp;</em></p><p><em>to the top &ndash; we deposited a bottle of Rum, and a bottle containing&nbsp;</em></p><p><em>the Constitution of Maine and a &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; by each of us on lead&nbsp;</em></p><p><em>placed under a rock over which Major Odel had made a&nbsp;</em></p><p><em>Monument on the summit of the Mtn.&ndash; We arrived at the&nbsp;</em></p><p><em>summit taking the bearings of Ponds and Mtns. until 4 P.M. when&nbsp;</em></p><p><em>we descended the steep South part at an angle of 40 degrees&nbsp;</em></p><p><em>2 miles to the New Stream or Launch in the Mtn. we then descended&nbsp;</em></p><p><em>this Gueph 2 miles at an angle of 20 degrees to the place where we&nbsp;</em></p><p><em>left a part of our baggage, and encamped at &frac12; past 7 P.M. &ndash;</em></p>","interpret_blurb":"<p>The expedition continued to encounter extremely low water that slowed or prevented passage upriver (today known as the West Branch of the Penobscot). The men decided to delay river travel in hopes that rains would bring higher water. They used the time to climb Mt. Katahdin. From that high point, Treat hoped that he could accurately report on the number, names, and locations of lakes, as well as the quality of nearby lands. They left the river to climb to the mountain&rsquo;s 5,000+ foot summit and back down over two cold days.</p>","interpret_more":"<p>When they reached the summit of Mt. Katahdin, the men deposited a bottle of rum and a bottle containing the Constitution of Maine. They then used a surveyor&rsquo;s compass to take the bearings of the surrounding lakes and mountains. Treat recorded the locations in his journal, along with the Wabanaki name of each feature. By recording Native names of lands and waters here and throughout his journal, Treat captured important details of life and culture in Native homelands. Another Wabanaki man, Louis Neptune, joined the group for the climb up Katahdin. Louis Neptune was a well-known guide who later advised Henry David Thoreau during his exploration of the Maine Woods. &nbsp;</p>"},{"title":"Chesuncook Lake","slug":"chesu-lake","entry_date":"14 October, 1820","lat":46.03,"lon":-69.2757,"zoom_level":10,"is_flippable":true,"entry_text":"<p>&nbsp; &nbsp; &nbsp;</p><p>&nbsp; &nbsp; &nbsp;<em>At 5 P.M. a gale of wind from the S.W. &ndash; cannot cross the Lake&nbsp;</em></p><p><em>and concluded to camp near the head of the Lake within 1 mile of the inlet. &nbsp;</em></p><p><em>N.E. side near an old and famous camping of all the Indians who&nbsp;</em></p><p><em>hunt about or cross this Lake, the shore and bank almost covered&nbsp;</em></p><p><em>with Moose Deer, Carriboo and Beaver Bones &ndash; here Messrs Odel,</em></p><p><em>&nbsp;Campbell and Loring camped, and Mr. L. left a writing for me on&nbsp;</em></p><p><em>birch bark, which the Indians had defaced. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The wind blew from the S.W. a gale during the night, and&nbsp;</em></p><p><em>at 6 P.M. on Sunday morning the 15th it commenced raining&nbsp;</em></p><p><em>the wind strong at S.W. we were compelled to remain&nbsp;</em></p><p><em>here &ndash; we find the soil very good &ndash; light loomy land &ndash;&nbsp;</em></p><p><em>growth mixed &ndash; some white and Norway pine on the&nbsp;</em></p><p><em>point where we camp &ndash; My intention was, and agreeably&nbsp;</em></p><p><em>to my instructions, to have gone up the West branch to&nbsp;</em></p><p><em>its source, but finding the water very low in the River,&nbsp;</em></p><p><em>had yesterday concluded to go up the river as far as the&nbsp;</em></p><p><em>Portage to Moose head, return to Cheesuncook, thence to St. Johns</em></p><p><em>but the season being late, the water so very low, and having lost&nbsp;</em></p><p><em>considerable time by stormy windy weather, and from information of the&nbsp;</em></p><p><em>Indians camped here that it will take 4 days to go and return from&nbsp;</em></p><p><em>Moose Lake &ndash; also that the water is very low in the St. John and&nbsp;</em></p><p><em>we cannot make much progress on our route &ndash; I this day concluded&nbsp;</em></p><p><em>to go as fast as possible to Madawaska which the Indians say in the&nbsp;</em></p><p><em>present state of the streams will take 10 to 12 days &ndash; I am however&nbsp;</em></p><p><em>in hopes that the last rains will raise the streams through which we&nbsp;</em></p><p><em>have to pass. -</em></p>","interpret_blurb":"<p>As the expedition progressed farther northward, bad weather and low water continued to make travel very difficult. The men, now paddling on the West Branch of the Penobscot River, had hoped to travel to its source and explore the portage to Moosehead Lake. Instead, they decided to proceed as fast as possible to the Allagash River, and then to the Saint John, while hoping for rain to raise water levels.</p>","interpret_more":"<p>Treat oriented this map with &ldquo;South&rdquo; at the top. The north end of Chesuncook Lake was well-known to John Neptune and other Penobscot hunters. The site was a famous camp, with a shore almost covered with moose, deer, caribou, and beaver bones. In contrast, non-Natives such as Moses Greenleaf had been there very little and failed to accurately map some of the land and water features for another thirty years. In his journal, Treat, likely with John Neptune&rsquo;s help, corrected some of the earlier mapping errors.</p>"},{"title":"Wallagasquecgamook Pond (Bark Wigwam Pond)","slug":"walla-pond","entry_date":"18 October, 1820","lat":46.615,"lon":-69.356,"zoom_level":10,"is_flippable":true,"entry_text":"<p><br></p><p>&nbsp; &nbsp; <em>We proceed down this [Pongockwaham] Pond 7 &frac12; miles to the foot&nbsp;</em></p><p><em>then 1&frac12; mile Bog or meadow and Small Pond, to a Strait&nbsp;</em></p><p><em>about 4 rods wide &ndash; thence down N. Easterly</em></p><p><em>through a wide stream grassey shores about 2 &frac12; miles (in which distance</em></p><p><em>there comes a small stream from the East, and a large one from&nbsp;</em></p><p><em>the West) to the Wal,la,gas,quec,ga,mook, or Bark Wigwam Pond, which is</em></p><p><em>3 miles long and 1 &frac12; to 2 in width - the growth around it is various-</em></p><p><em>but much good pine - all this day having been rainy and foggy we</em></p><p><em>get no view of land distant from the shores of the Pond - we proceed down&nbsp;</em></p><p><em>to the foot of the Pond, and camp on the N.E. side at a strait about</em></p><p><em>4 rods wide - there are three considerable streams come into this Pond -</em></p><p><em>that in the N.E. Bay is a large stream - has several ponds - as many</em></p><p><em>as seven on all its branches.</em></p>","interpret_blurb":"<p>Fed by rains, the string of lakes and streams forming the Allagash River at last provided higher water levels that made travel much easier. In this area, as around Chesuncook, Greenleaf&rsquo;s map showed Wabanaki names for the lakes, but did not record their locations accurately. Treat marked one notable landmark, &ldquo;Grand Falls&rdquo; in red above Bungah-Quohem Lake (perhaps present-day Churchill Lake). The falls is likely what is known today as Allagash Falls.</p>","interpret_more":"<p>Treat oriented this map with &ldquo;South&rdquo; at the top. Treat notes in his journal that Wallagasquecsamook Pond, or Bark Wigwam Pond, was named by the &ldquo;St. John Indians&rdquo; (Maliseets), a Wabanaki tribe in the area. According to Treat, the Maliseets knew the river as Wallagasquecsamook to its union with the &ldquo;Walloostook, or good river, the main St. John.&rdquo; A key mission of Treat&rsquo;s journey was to record tree growth on the lands he saw. Here around Wallagasquecsamook Pond, as in other locations, he noted the tree cover in detail. With this information, the new Maine state government could better understand the economic value of the northland&rsquo;s vast forests.</p>"},{"title":"John Hartford's House","slug":"hartford-house","entry_date":"21 October, 1820","lat":47.2317,"lon":-68.7428,"zoom_level":10,"is_flippable":false,"entry_text":"<p><br></p><p>&nbsp; &nbsp; <em>Mr. Hartford informs me that he raised from 1&frac12;&nbsp;</em></p><p><em>bushels spring wheat 34 Bushels of excellent sound wheat and&nbsp;</em></p><p><em>that from 11 bushels of Potatoes he raised 200 of excellent quality &ndash;&nbsp;</em></p><p><em>This land produces Barley, Oats, and Peas a good yield &ndash; very large&nbsp;</em></p><p><em>Turnips &ndash; good Pumpkins &ndash; and corn ripened here this season which&nbsp;</em></p><p><em>was planted as late as the 12th June. - &nbsp;&nbsp;</em></p><p><em>Mr. Hartford informs me that vegetation did not suffer&nbsp;</em></p><p><em>this season on account of drought &ndash; there was however frequent showers&nbsp;</em></p><p><em>that both the upland and intervale is of a moist and also a light&nbsp;</em></p><p><em>quality which stands a dry season &ndash; he sowed three pecks Barley- over&nbsp;</em></p><p><em>which a fire run late in June which destroyed half of it he having&nbsp;</em></p><p><em>cleared it in May and June &ndash; he raised 15 Bushels &ndash; he sowed&nbsp;</em></p><p><em>flax seed on 25 May, it produced 37&frac12; feet high. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp;Mr. Hartford went first to Madawaska in 1818 &ndash; came to&nbsp;</em></p><p><em>this place last November and in July he received a summons on a&nbsp;</em></p><p><em>writ of ejectment issued at Frederickton by Mr. Whitmore the&nbsp;</em></p><p><em>King&rsquo;s Agent &ndash; which suit he attended &ndash; and sent a petition to&nbsp;</em></p><p><em>the Governor to quiet him in his possession &ndash; and the affair&nbsp;</em></p><p><em>rests here. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The British Government give permits to their subjects to cut&nbsp;</em></p><p><em>pine timber any where up the St. Johns, Aroostick and Madawaska. &nbsp;</em></p><p><em>These men take American&rsquo;s for partners and cut timber all&nbsp;</em></p><p><em>over the Country, as high up the St. John as Mr. Hartford&rsquo;s and</em></p><p>some above. &ndash;</p>","interpret_blurb":"<p>With its arrival on the Saint John River, the expedition found itself in the center of valuable lands that both the American and British governments wanted to control. The nations could not agree on the international border. Here, in the map indicating the route of the expedition&apos;s 1820 journey, the American view of the border is marked with a thick yellow line and labeled &ldquo;Supposed Boundary Between the United States and Lower Canada.&rdquo; That &ldquo;supposed boundary&rdquo; extended far north of the Saint John River and the location of John Hartford&rsquo;s house.</p>","interpret_more":"<p>From this point on, Treat orients his map with&ldquo;North&rdquo; at the top. In interviews with John Hartford and other newcomers to the area, Treat reflected the changes that settlers, along with disputing English and American governments, were bringing to Wabanaki homelands. Americans John Hartford and his wife had established a farm along the Saint John River about a year before Treat met them. Their farm was a productive one, yielding wheat, potatoes, barley, oats, peas, turnips, pumpkins, corn, and flax. Shortly after arriving, however, Hartford had received an eviction notice from the King of England&rsquo;s agent in Fredericton, New Brunswick. Hartford appealed that eviction. It had not been resolved by the time of Treat&rsquo;s visit.</p>"},{"title":"Simon Hébert's House","slug":"herbert-house","entry_date":"23 October, 1820","lat":47.3411,"lon":-68.3247,"zoom_level":10,"is_flippable":false,"entry_text":"<p><br></p><p>&nbsp; &nbsp; <em>The most of the present inhabitants of Madawaska at&nbsp;</em></p><p><em>the commencement of the Revolution, had settled at St. Ann&rsquo;s on</em></p><p><em>what is now called Frederick Town and below on the St. John and&nbsp;</em></p><p><em>after peace took place some British Agent represented to the Governor of the&nbsp;</em></p><p><em>Province that the French settlers had taken up a fine tract of Land&nbsp;</em></p><p><em>at an important place for the British Government to establish a Port.</em></p><p><em>The Governor issued orders to give those settlers each two hundred feet&nbsp;</em></p><p><em>of land in front running back 1 mile &ndash; if they would relinquish the&nbsp;</em></p><p><em>remainder &ndash; The Frenchmen all removed from St. Ann&rsquo;s &ndash; some went to&nbsp;</em></p><p><em>Canada some to Madawaska in 1783 - or 84 from those Emigrants spring&nbsp;</em></p><p><em>the race of Madawaskians &ndash; since which time many have moved here from Canada. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp;There are now from 30 to 40 families on the&nbsp;</em></p><p><em>St. John above Madaweska &ndash; At Madaweska and below to the&nbsp;</em></p><p><em>church 50 to 60 families &ndash; from thence down to Grand Falls there&nbsp;</em></p><p><em>are as many as 50 to sixty &ndash; making in the whole one hundred&nbsp;</em></p><p><em>and fifty families and each family may be reckoned at 6 to 8&nbsp;</em></p><p><em>persons. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp;From Madaweska to Mons. Simobear&rsquo;s is 2 miles&nbsp;</em></p><p><em>the River &frac14; to &frac12; mile wide 2 large Islands &ndash; the intervale on each&nbsp;</em></p><p><em>side is wide &ndash; and on Simobear&rsquo;s land is from 160 to 200 rods excellent&nbsp;</em></p><p><em>soil &ndash; the lower part overflows in freshes &ndash; the river here runs about&nbsp;</em></p><p><em>South East &ndash; the first bank from the River rises about 15 feet &ndash; the&nbsp;</em></p><p><em>second about 10 feet and in many places as in the Ohio there are three&nbsp;</em></p><p><em>slopes or banks from the River to the highlands &ndash; the soil on all these&nbsp;</em></p><p><em>is of an excellent quality as is the highlands in the rear &ndash; the soil on&nbsp;</em></p><p><em>the hills or ridges is of a light sandy loam very few rocks on the</em></p><p><em>hills and none on the low lands. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp;The Madaweskians raise good wheat, rye, oats, barley and peas&nbsp;</em></p><p><em>and excellent potatoes &ndash; the land produces excellent grass &ndash; they keep&nbsp;</em></p><p><em>many cows and oxen of a small hardy breed- very fat also&nbsp;</em></p><p><em>and small Canadian or Pony horses &ndash; which are very serviceable &ndash; a&nbsp;</em></p><p><em>small proportion of their cleared land is tilled compared with the&nbsp;</em></p><p><em>quantity of grass or meadow land. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp;The Madaweskian Houses are built generally with small&nbsp;</em></p><p><em>hewn timber, one or 1&frac12; stories high covered with long shingles on&nbsp;</em></p><p><em>the roof &ndash; contain one room and two small apartments &ndash; and s</em></p><p><em>some two rooms on the floor &ndash; some of their houses are built&nbsp;</em></p><p><em>with round logs &ndash; and covered with straw or thatched &ndash; their&nbsp;</em></p><p><em>Barns are 20 &ndash; 25 feet wide and 30 to 40 long made of round&nbsp;</em></p><p><em>logs, the roof covered with straw &ndash; they have no bricks &ndash; their&nbsp;</em></p><p><em>chimneys made of stone laid in clay mortar &ndash; topped with&nbsp;</em></p><p><em>sticks or cat and clay. &ndash;</em></p><p><br></p>","interpret_blurb":"<p>Treat&rsquo;s expedition was the first to travel to the upper Saint John Valley and represent the new state of Maine&rsquo;s interests. The upper Saint John Valley was nearly the end of the line for people and goods traveling from the south. But for those traveling west to east, including Maliseet families as well as British and French traders, the Saint John Valley was on a major trade route between the port city of Saint John, New Brunswick and Quebec and Ontario on the Saint Lawrence River. Simon H&eacute;bert, a merchant, trader, and innkeeper, had his business and dwelling at the junction of the Madawaska (R. Matawascah on Greenleaf&rsquo;s map) and Saint John Rivers &ndash; a central spot on the east-west route.</p><p><br></p>","interpret_more":"<p>Due to rain delays, Treat, Neptune, and Holyoke stopped for longer than planned at Simon H&eacute;bert&rsquo;s house. They had a comfortable stay and purchased supplies. Treat, who had recently started making his journal on birch bark, recorded information about the Maliseet (a Wabanaki tribe in this area) settlement nearby (1,000 to 1,500 &ldquo;souls&rdquo;), as well as detailed descriptions of the homes, crops, and history of the French settlement (totaling, according to Treat, 150 families of six to eight people each). In his drawing, Treat showed the Catholic church, Saint Basile, on the north side of the river. He also represented the &ldquo;Indian Camp &amp; Settlement&rdquo; on the north side of the river, as well as the French dwellings on the south side of the river, and &ldquo;Mons Simobears 2 houses.&rdquo; &ldquo;Simobear&rdquo; was Treat&rsquo;s phonetic spelling of the French name Simon H&eacute;bert.&nbsp;</p><p><br></p>"},{"title":"Grand Falls","slug":"grand-falls","entry_date":"25 October, 1820","lat":47.035,"lon":-67.7767,"zoom_level":10,"is_flippable":false,"entry_text":"<p><br></p><p>&nbsp; &nbsp; <em>On the hill over which the Portage Road passes 80 rods from&nbsp;</em></p><p><em>the River opposite the falls the English keep a military Post &ndash; They&nbsp;</em></p><p><em>have four or five Barracks and a store house &ndash; No troop here&nbsp;</em></p><p><em>now &ndash; Only occupied by a Sergeant &ndash; who takes care of the public&nbsp;</em></p><p><em>property and keeps a house of entertainment &ndash; he was not at&nbsp;</em></p><p><em>home &ndash; saw 3 women only &ndash; one a Scotch &ndash; one English &ndash; one Irish&nbsp;</em></p><p><em>all soldiers wives or widows &ndash; treaty [treated] us politely &ndash; we left this house at&nbsp;</em></p><p><em>1 P.M. to cross the Portage with the remainder of our baggage &ndash;&nbsp;</em></p><p><em>still snowing and cold squally weather &ndash; at 2 P.M. embarked at the&nbsp;</em></p><p><em>Portage and proceeded down river. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; On viewing the fall below as well as above the&nbsp;</em></p><p><em>rapids, I calculate this distance round the River to be 1&frac12; miles&nbsp;</em></p><p><em>the fall 75 to 80 feet or near that &ndash; it is &frac34; mile across the&nbsp;</em></p><p><em>Portage, which is over a very steep hill particularly in descending&nbsp;</em></p><p><em>to the Portage Landing on south side &ndash; This fall is called by&nbsp;</em></p><p><em>the Indians &nbsp;</em></p><p><em>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Chee,ka,chee,nee,ga,bick. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp;The banks on each side from 40 to 50 fee perpendicular&nbsp;</em></p><p><em>rocks - then a high ridge of spruce land on each side -&nbsp;</em></p><p><em>back of which is a ridge or ridges of hard or mixed wood from&nbsp;</em></p><p><em>head to foot of falls - thence high gravelly spruce banks from 40&nbsp;</em></p><p><em>to 50 feet very steep high ridges not far back are frequently</em></p><p><em>seen from the river generally running parallel with the river -&nbsp;</em></p><p><em>these remarks apply to the distance of two miles below the&nbsp;</em></p><p><em>falls. -</em></p><p><em>&nbsp; &nbsp; &nbsp;In case with a war with England it would be an&nbsp;</em></p><p><em>advantage to the United States to have some knowledge of the&nbsp;</em></p><p><em>extent of the settlement and number of inhabitants on the&nbsp;</em></p><p><em>St. John in the vicinity of the Boundary Line &ndash; I&nbsp;</em></p><p><em>therefore, continue my plan of the River and mark the houses&nbsp;</em></p><p><em>on its banks as I pass down. &ndash;</em></p><p><br></p>","interpret_blurb":"<p>Continuing down the Saint John River, Treat, Neptune, and Holyoke saw the physical north-south boundary line that separated the United States and British New Brunswick. That boundary is marked by a thick yellow line in the map shown here. On the ground, Treat, Neptune, and Holyoke climbed a spruce to get a good view of the boundary, which was shown by markings, or &ldquo;spotting,&rdquo; on a line of trees.</p>","interpret_more":"<p>Throughout their journey, Treat, Neptune, and Holyoke, often carried, or portaged, their two canoes and supplies around falls, low water, or other impassable places. The men encountered a long, steep, difficult portage around the dramatic 75-foot-high Grand Falls. Along that &frac34; mile portage, the men came upon a British military post, established to oversee all traffic up and down the strategically important Saint John River. By October 1820 with at least the eastern portion of the boundary settled, Treat reported that no troops occupied the post except a sergeant, who took care of the property, and three women - one Scottish, one English, and one Irish who were all wives or widows of soldiers.</p>"},{"title":"Aroostook River","slug":"aroos-river","entry_date":"27 October, 1820","lat":46.7888,"lon":-67.7774,"zoom_level":10,"is_flippable":false,"entry_text":"<p><br></p><p>&nbsp; &nbsp; <em>In passing up the Arroostick we see many logs and&nbsp;</em></p><p><em>pieces of excellent hewed pine timber on the shores and ledges in&nbsp;</em></p><p><em>the River and particularly on the falls - &frac14; mile above the Portage&nbsp;</em></p><p><em>is a large camp or lumber house where the men lived when&nbsp;</em></p><p><em>cutting and rafting their timber. &ndash; On the S. side the stream and&nbsp;</em></p><p><em>&frac14; mile below the line is a large log store house covered with&nbsp;</em></p><p><em>bark standing near the shore on the north side probably&nbsp;</em></p><p><em>used by the Surveyors Party two or three years ago when running</em></p><p><em>the Boundary line to keep their provisions &amp;c. &ndash; the land after</em></p><p><em>passing the Portage and above falls to this place and where we&nbsp;</em></p><p><em>camp looks well &ndash;some intervale on each side &ndash; good ridges&nbsp;</em></p><p><em>back- rather high and steep &ndash; We have passed one small good&nbsp;</em></p><p><em>Island above the line &ndash; there is much Balm of Gilead</em></p><p><em>trees on the shores and on the Islands some one foot and a&nbsp;</em></p><p><em>half diameter &ndash;growth generally maple, birch, ash and&nbsp;</em></p><p><em>elm &ndash; the back ground mixed growth the hills in the&nbsp;</em></p><p><em>rear hard wood. &ndash;&nbsp;</em></p><p><em>Saturday morning 28 October 1820. Snow Storm. -</em></p><p><em>It commenced snowing last evening at nine o&apos;clock, and snowed</em></p><p><em>a little during the night - very cold weather - Here we concluded</em></p><p><em>to go one days journey up the Aroostick and return to the St. John</em></p><p><em>and home by Madawamkeag. - </em></p><p><br></p><p><br></p><p><br></p>","interpret_blurb":"<p>The Aroostook River was known to have rich stands of timber along its shores. The river&rsquo;s source deep in the new state of Maine, and end at the Saint John River in New Brunswick, also meant that its timber and waters held economic value for lumbermen from both countries. Treat had originally planned to journey up the Aroostook, cross a portage, and go down the East Branch of the Penobscot River to get a full picture of the river, and its surroundings. The worsening weather, low water, and advice of the experienced and knowledgeable John Neptune convinced Treat to change plans and go one day&rsquo;s journey up the Aroostook, return to the Saint John, and head home by another route. &nbsp;</p>","interpret_more":"<p>On their one-day journey up the Aroostook River, Treat, Neptune, and Holyoke saw many stumps of pine trees cut from one to three years ago, as well as mill logs and timber on the shore and evidence of a large camp where men had lived when cutting and rafting timber downriver. In addition to what he saw and drew on the map, Treat learned that the shores held &ldquo;a great plenty of pine&rdquo; 30 to 40 miles upriver and that logs and timber had been cut 50 to 60 miles upriver.</p>"},{"title":"Overland Route to Houlton","slug":"houlton","entry_date":"31 October, 1820","lat":46.1166,"lon":-67.6057,"zoom_level":10,"is_flippable":false,"entry_text":"<p><br></p><p>&nbsp; &nbsp; <em>Holton plantation is situated on a fine ridge of hard&nbsp;</em></p><p><em>wood land 12 miles west from the mouth of Maduxeneekeek&nbsp;</em></p><p><em>River &ndash; there are 16 families settled here &ndash; the settlement was&nbsp;</em></p><p><em>commenced 15 or 20 years ago by Mr. J. Holton, and by his extra</em></p><p><em>-ordinary perseverance, overcoming many difficulties incident to the&nbsp;</em></p><p><em>wilderness, such as having no roads, mills or any of the conveniences,&nbsp;</em></p><p><em>and but few of the comforts of life &ndash; but under all these difficulties&nbsp;</em></p><p><em>the settlement has increased and is now in a prosperous situation &ndash;&nbsp;</em></p><p><em>they keep good stocks of cattle &ndash; raise good wheat, rye, barley,&nbsp;</em></p><p><em>oats, peas, beans, and potatoes, and in good seasons, like the present&nbsp;</em></p><p><em>plenty of Indian corn. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp;The principal inhabitants here are Messrs J. Holton,&nbsp;</em></p><p><em>S. Cook, A. Putnam, James Holton &ndash; all of whom are&nbsp;</em></p><p><em>industrious active men &ndash; they still suffer many privations such&nbsp;</em></p><p><em>as having no communication with the States by any other way&nbsp;</em></p><p><em>than by water and passing many Portages &ndash; for the benefit of&nbsp;</em></p><p><em>the State, as well as these people a Road from the Penobscot&nbsp;</em></p><p><em>should be opened by the way of Madawamkeag &ndash; which would pass</em></p><p><em>through a great tract of good land belonging to the State &ndash;&nbsp;</em></p><p><em>which road should be continued to the Arroostick thence to&nbsp;</em></p><p><em>Madawaska. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp;There are five families in Limerick Grant&nbsp;</em></p><p><em>and in this and Holton together there are 140 souls. &ndash;</em></p><p><br></p>","interpret_blurb":"<p>Maine&rsquo;s new government needed a land agent to oversee the harvest and sale of valuable timber on lands thought to be owned by the state. Not finding a local person on the Saint John or Aroostook Rivers to do this important work, Treat decided to take a side trip to the American settlement in Houlton (or Holton, as Treat spelled it) to find a suitable person. Treat borrowed horses at a small settlement near the confluence of the Meduxnekeag and Saint John Rivers and set off to the west on the Houlton Road.&nbsp;</p>","interpret_more":"<p>Before heading west to Houlton on horseback, Treat sketched all the houses on the nearest section of the Saint John River, as he had elsewhere, because he reasoned that such detailed information would be helpful for the United States in case of war with England. At Houlton, Treat learned about that community, which had begun about 20 years earlier and by 1820 included 16 families. Treat wrote about the necessity of good roads there, as Houlton then had no communication with the rest of Maine except by water and several portages. Treat learned about British subjects cutting timber illegally on American lands nearby and recommended the appointment of a Houlton lawyer to supervise the Maine-owned lands and timber in the area.</p>"},{"title":"Meductic Fort","slug":"meduc-fort","entry_date":"07 November, 1820","lat":45.9774,"lon":-67.4815,"zoom_level":10,"is_flippable":false,"entry_text":"<p><br></p><p><em>At one P.M. landed at Watson&rsquo;s on the E. Side &ndash;&nbsp;</em></p><p><em>here we meet Mr. Watson who lives at the Portage &ndash; he agrees&nbsp;</em></p><p><em>to furnish us with provisions of which we are nearly out &ndash; not&nbsp;</em></p><p><em>on hand more than for three days &ndash; We proceed down River&nbsp;</em></p><p><em>to his house on the West side about one and a half miles&nbsp;</em></p><p><em>where we land and have to wait to get some bread baked&nbsp;</em></p><p><em>and get our stores &amp;c. and it being to late to pass the&nbsp;</em></p><p><em>Portage we remain here this night, at the house of Mr.&nbsp;</em></p><p><em>Alexander Watson. &ndash;</em></p><p><em>Wednesday 8. November &ndash; Cold and appearance of snow storm. &nbsp;</em></p><p><em>After getting our store of Mr. Watson and a man to assist us&nbsp;</em></p><p><em>across the Portage &ndash; we go &frac34; mile below to Portage Road and&nbsp;</em></p><p><em>proceed across &ndash; ascending a fine hard wood ridge three miles &ndash;&nbsp;</em></p><p><em>thence descending hard wood land two miles &ndash; thence mixed and&nbsp;</em></p><p><em>low land half a mile to Eel River Portage Landing where we&nbsp;</em></p><p><em>arrived at &frac12; past two P.M. it commenced snowing at 11 A.</em></p><p><em>M. &ndash; After getting some dinner we proceed up. &ndash;</em></p>","interpret_blurb":"<p>After conducting surveys in the Houlton area, Treat and his party returned on horseback to the Saint John River through snow six inches deep and cold &ldquo;squally&rdquo; weather. At a small English settlement near the Eel River portage, they purchased some freshly baked bread and new supplies for the final leg of the expedition, which would prove in many ways to be the most difficult. Before setting off on the portage, they left one of their canoes behind because it was nearly worn out and had little value. Treat directed a local resident, Mr. Watson, to sell the canoe for two dollars, if no more could be obtained for it.&nbsp;</p>","interpret_more":"<p>At the beginning of the Eel River portage, Treat, Neptune, and Holyoke passed a Native fortification. Treat labelled it as &ldquo;Meducktuck old Indian Fort and Settlement now abandoned,&rdquo; yet he showed three rows of Maliseet wigwams around it. Meductic was a Maliseet village on a well-known canoe and portage route between the Penobscot and Saint John Rivers. Scholars now believe that travel and communication along this route brought Abenaki here from elsewhere in New England in the late 1600s, and with them, methods of cultivating and storing crops, such as corn, that were shared with the local Maliseet tribe.</p><p><br></p>"},{"title":"Baskehegan Stream","slug":"baske-stream","entry_date":"12 November, 1820","lat":45.6793,"lon":-67.9422,"zoom_level":10,"is_flippable":false,"entry_text":"<p><br></p><p><em>Sunday morning 12 November &ndash; very cold and cloudy &ndash; appearance of&nbsp;</em></p><p><em>a snow storm &ndash; last night was extremely cold &ndash; the ice froze at&nbsp;</em></p><p><em>our Landing place half an inch &ndash; we this morning commence our&nbsp;</em></p><p><em>route down stream by carrying our canoe and baggage on the&nbsp;</em></p><p><em>shore &ndash; We carry on the shore &frac14; mile to strong ice &ndash; here we&nbsp;</em></p><p><em>make a temporary sled of a crotched tree and proceed on the ice</em></p><p><em>&frac14; mile find marker, then clear a portage &frac12; a mile by the weak ice &ndash;&nbsp;</em></p><p><em>here we make another sled 20 feet long by fixing two poles four&nbsp;</em></p><p><em>feet apart and bark them together with Elm bark attached to&nbsp;</em></p><p><em>cross sticks for bars &ndash; and then proceed on the ice one mile and&nbsp;</em></p><p><em>finding many places not more than one inch of ice &ndash; Holyoke&nbsp;</em></p><p><em>forward with a stick trying the strength of the ice, Neptune&nbsp;</em></p><p><em>crawling with a line 20 feet long hauling the canoe and myself</em></p><p><em>with a long pole pushing the canoe &ndash; we proceed in this manner on&nbsp;</em></p><p><em>the ice about one mile where we discover open water &ndash; here&nbsp;</em></p><p><em>Holyoke and Neptune land on shore &ndash; I take off great coat&nbsp;</em></p><p><em>and boots &ndash; and run the canoe near the open water then leap on&nbsp;</em></p><p><em>board and break the ice with a pole &ndash; then land and take them&nbsp;</em></p><p><em>on board and proceed down stream &frac12; mile where we meet the&nbsp;</em></p><p><em>ice &frac14; mile above Beaver Brook &ndash; having left our sled we here&nbsp;</em></p><p><em>break down the ice and get on and haul our canoes &frac14; mile&nbsp;</em></p><p><em>to Beaver brook &ndash; we venture on ice too far and break in Neptune&nbsp;</em></p><p><em>and Holyoke being near the canoe get on board and I fall in&nbsp;</em></p><p><em>the stream &ndash; but after a few minutes get on board with no damage&nbsp;</em></p><p><em>only a complete ducking &ndash; we then proceed down stream &ndash;&nbsp;</em></p><p><em>sometimes clear stream and sometimes breaking ice &ndash; we go in this&nbsp;</em></p><p><em>manner one mile and meet the stream full of loose ice &ndash; we&nbsp;</em></p><p><em>then land on the south side &ndash; it is now 12 o&rsquo;clock &ndash; it com-</em></p><p><em>menced snowing at 11 A.M. &ndash; we now clear a Portage &frac12; a&nbsp;</em></p><p><em>mile by the ice which we get done at 4 P.M. &ndash; we remain&nbsp;</em></p><p><em>at our Landing place during this night &ndash; which continues&nbsp;</em></p><p><em>a severe cold snow storm.</em></p>","interpret_blurb":"<p>Snow, rain, wind, and cold surrounded Treat, Neptune, and Holyoke during their four-day journey south and west across portages and lakes to Baskehegan Stream. Large waves and strong winds were so bad crossing one of the lakes that spray froze on their cloths and baggage. Water nearly filled their canoe. On reaching Baskehegan Stream, Treat wrote that they held a &ldquo;Council&rdquo; to discuss whether it would be better to leave their canoe behind and proceed home 75 miles on foot. They decided to try Baskehegan Stream, concluding to go down stream by putting their frail canoe on the one-inch-thick ice and breaking through it with paddles and poles.&nbsp;</p>","interpret_more":"<p>Baskehegan Stream proved to be barely passable. Treat&rsquo;s drawing in his journal shows the continuous succession of water, land, and ice that the three men had to pass through. Treat described the process in grim detail in the journal excerpt below. Finally, they reached the Mattawamkeag River after two days of very difficult travel. On the river, they still had to carry their canoe and baggage, at one point for three miles through the woods, because the river ice could not hold them.</p>"},{"title":"Mattawamkeag and Penobscot Rivers","slug":"mataw-river","entry_date":"16 November, 1820","lat":45.5044,"lon":-68.3556,"zoom_level":10,"is_flippable":false,"entry_text":"<p><br></p><p>&nbsp; &nbsp; <em>Then going one mile below Namadunkeeank we meet the ice&nbsp;</em></p><p><em>in the stream and carried by half a mile &ndash; then by water to Mada</em></p><p><em>wamkeag Point, where we arrived at 5 P.M. &ndash; Thence went one mile down&nbsp;</em></p><p><em>the Penobscot and camped on the West side. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; We have no provisions except two quarts of Indian meal&nbsp;</em></p><p><em>and 1/3 of a pound of Pork &ndash; a small quantity of ginger and&nbsp;</em></p><p><em>some sugar &ndash; We make our meal into hasty pudding and eat&nbsp;</em></p><p><em>half of that and the pork for supper &ndash; and hope to arrive&nbsp;</em></p><p><em>tomorrow night at Passadumkee where we can replenish our&nbsp;</em></p><p><em>stock of Provisions. &ndash;</em></p><p><em>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; We have seen no person on all our route from&nbsp;</em></p><p><em>Eel River to Penobscot. -&nbsp;</em></p><p><em>Friday morning 17th November fair weather</em></p><p><em>We embark and proceed down river two miles and&nbsp;</em></p><p><em>find the river full of ice &ndash; we land on an Island and carry by into&nbsp;</em></p><p><em>an open channel and proceed &frac12; mile. &ndash; then break through a bar&nbsp;</em></p><p><em>of ice, and go by water about half a mile when we meet&nbsp;</em></p><p><em>solid strong ice across the river &ndash; we then haul our canoe&nbsp;</em></p><p><em>on the ice about two miles in hopes to find the river open&nbsp;</em></p><p><em>below &ndash; but are disappointed and leave our canoe on the&nbsp;</em></p><p><em>east side about half a mile below Woodbury&rsquo;s clearing &ndash;&nbsp;</em></p><p><em>and secure her in the woods &ndash; we then proceed down on the&nbsp;</em></p><p><em>east side carrying our baggage about three miles and&nbsp;</em></p><p><em>camp on the East side opposite Kes,sess,kee,nau,gus, or Nathan&rsquo;s&nbsp;</em></p><p><em>Island with heavy hearts and light suppers. &ndash;</em></p>","interpret_blurb":"<p>The arrival of the three men at the confluence of the Mattawamkeag and Penobscot Rivers brought them back to an important place where they had stopped almost two months earlier near the beginning of their journey. During warmer seasons, this place was the residence of Penobscot Governor John Attean. In late November, however, the Native camps were gone. Treat, Neptune, and Holyoke, in fact, had seen no other person for the past ten days of their journey. The only food they had remaining was two quarts of Indian meal, 1/3 pound of pork, and some ginger and sugar.&nbsp;</p>","interpret_more":"<p>This drawing was the last that Treat made in his journal. With the group&rsquo;s return to the Penobscot River, it must have seemed that the men were almost home. Challenges lay ahead, however. The Penobscot River was full of ice, too. The men hauled their canoe on the ice about two miles, hoping to find the river open. But, the river ice was &ldquo;solid strong,&rdquo; as Treat wrote. The men had no choice but to leave their canoe in the woods and proceed on foot. Three miles later, they camped for the night &ldquo;with heavy hearts and light suppers.&rdquo; The next day, they made it to Passadumkee (Passadumkeag River) and the small English settlement there. Continuing on foot, they arrived in Bangor on November 20. Treat sent his report, journal, and maps immediately to Gov. King and so, with John Neptune and Jacob Holyoke, completed the expedition&rsquo;s official work.</p><p><br></p>"}]
